<?php
/**
 * 后台文章管理程序文件
 * ============================================================================
 * 版权所有 2018 
 *-----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * Author: 李坤霖  Contact: 1079539864@qq.com  
*/
if (!isset($_SESSION)) {
	session_start();//开启session
}

if( @$_SERVER['HTTP_REFERER'] == "" ){//禁止直接从浏览器地址栏打开
    header("Location: ../webSystem.php");
    exit();
}
if(empty($_SESSION['is_user']) || $_SESSION['is_user'] !="yes"){//判断是否登录了
    header("Location: ../webSystem.php");
    exit();
}
?>
