<?php
/**
 * 后台文章管理程序文件
 * ============================================================================
 * 版权所有 2018 
 *-----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * Author: 李坤霖  Contact: 1079539864@qq.com  
*/

ob_start();//防止output导致header出错
@header("Content-type:text/html;charset=UTF-8");//把编码转换为utf8

/* 连接数据库获取数据 */
include_once '../includes/db_connect.php'; $db = new MyDB();

/*----------------------------------------------------------*/
/*统计文章点击数*/
/*----------------------------------------------------------*/
if($_REQUEST['act'] == "hit" && !empty($_GET['id'])){
    
    $sql = "UPDATE `article` SET `hit` = `hit`+1 WHERE `id` = '". $_GET['id']. "' LIMIT 1";
    
    $db->Query($sql);
}
/*----------------------------------------------------------*/
/*获取文章点击数*/
/*----------------------------------------------------------*/
if($_REQUEST['act'] == "view" && !empty($_GET['id'])){

    $sql = "SELECT `hit` from `article`  WHERE `id` = '". $_GET['id']. "' LIMIT 1";

    $data = $db->GetData($sql);
    
    echo "document.write('$data[hit]')";
    //在页面调用这个就能动态获取浏览次数了：<script type="text/javascript"  src="../manage/countHit.php?act=view&&id=1" ></script>
}
?>